/* ----------------------------------------------------------------------------
 *         vteng 公司提供支持 
 * ----------------------------------------------------------------------------
 * 版权：2010 VTENG公司
 *
 * 公司保留所有权力
 *
 *此文件为管理所有APP的头文件
 *
 *
 *
 *
 *
 * ----------------------------------------------------------------------------
 */

#ifndef APP_H
#define APP_H
//头文件
#include "includes.h"
#include "task.h"
#include "data.h"
#include "alarm.h"
//类型定义
//事件定义
//定义系统状态变量结构
//变量定义

#endif//APP_H


