/* ----------------------------------------------------------------------------
 *         vteng 公司提供支持 
 * ----------------------------------------------------------------------------
 * 版权：2010 VTENG公司
 *
 * 公司保留所有权力
 *
 *此文件为管理所有DRIVE的头文件
 *
 *
 *
 *
 *
 * ----------------------------------------------------------------------------
 */

#ifndef DRIVE_H
#define DRIVE_H
//头文件
#include "includes.h"
#include "CC110X.h"
#include "nv.h"
#include "queue.h"
#include "time.h"
#include "type.h"
#include "W25X16.h"
#include "usb.h"
#include "sio.h"
//类型定义
//事件定义
//定义系统状态变量结构
//变量定义

#endif//DRIVE_H


