/* ----------------------------------------------------------------------------
 *         vteng 公司提供支持 
 * ----------------------------------------------------------------------------
 * 版权：2010 VTENG公司
 *
 * 公司保留所有权力
 *
 *此文件为NV定义的空间
 *会在FLASH里面定义一块连续的区域用于NV保存参数或字体等。
 *
 *
 *
 *
 * ----------------------------------------------------------------------------
 */

#ifndef NV_H
#define NV_H

typedef enum 
{
    NV_FONT_ADDR = 0,//120160 -120k
    NV_SRF_ADDR = 0X1E000,//7891-8k
    NV_MAX_ADDR = 0X20000
  
}NV_ENUM_ADDR;

#endif //NV_H